{
    "ADAIntelligentSolutionDesignAndOperations.md": {
        "Title": "Ecosystem: ADA - collaboration-centric and AI-augmented solution design & operations",
        "GitHub Path": "https://github.tools.sap/CloudNativeCulture/Ecosystem/blob/main/Sessions/PastSessions/2023/ADAIntelligentSolutionDesignAndOperations.md",
        "Abstract": "ADA is an ArchOps Prototype that demonstrates collaboration-centric and AI-augmented approach to solution design and operations that aims to improve the engineering experience. It consists of two main components: Collaborative Diagramming and ADA Assistant.\n\nDuring this session we will show you:\n\n- how Collaborative Diagramming app can make solution design and infrastructure development more efficient, reliable and fun\n- how ADA Assistant could augment Architects and Developers, while they are working on Solution Architecture and Infrastructure. We will also give you the examples of AI usecases and share our findings.\n\nADA was created by partnered teams Protopia_ and NVT FutureHub with support of Microsoft.",
        "Date of Evaluation": "2023-07-17",
        "Development Phase": "Requirements, Plan",
        "Adoption Readiness": "Visionary",
        "Scopes": "General",
        "Cluster": "Architecture, Artificial Intelligence",
        "External Speaker": false
    },
    "AiLeap.md": {
        "Title": "Ecosystem: A leap forward in AI? How are Chat GPT, Vall-E affecting us",
        "GitHub Path": "https://github.tools.sap/CloudNativeCulture/Ecosystem/blob/main/Sessions/PastSessions/2023/AiLeap.md",
        "Abstract": "In the last weeks we have seen a huge hype on the capabilities of Chat-GPT. Lately machine learning models are becoming better very rapidly: they can write letters, modify videos and synthesize speech with an increasing quality.  With this advancement they are also becoming mainstream and people outside of IT jobs will get easy access to these capabilities.\n\nThis session looks at possible benefits, but also risks associated due to this development. Not going into the technical details, it should give some room for discussion. How will AI impact our daily work and the overall society. How can SAP make benefit out of it?",
        "Date of Evaluation": "2023-07-17",
        "Development Phase": "Code",
        "Adoption Readiness": "Early Adopter",
        "Scopes": "General",
        "Cluster": "Developer Experience, Security, Artificial Intelligence",
        "External Speaker": false
    },
    "AI_Tooling.md": {
        "Title": "Ecosystem: AI Engineering Tools",
        "GitHub Path": "https://github.tools.sap/CloudNativeCulture/Ecosystem/blob/main/Sessions/PastSessions/2023/AI_Tooling.md",
        "Abstract": "With the ever increasing capability of AI there are new tools available that can significantly improve the developer experience.\n\nIn this session we will show you how we enhanced SAP open source sflight CAP example using AI based commercial tools.\nCurrently those tools are not allowed for usage within SAP. But still makes sense to learn and explore the capabilities these tools offer.\n\n- How to generate test data, enhance code and create tests with **GitHub CoPilot**\n- How to get information on code security and code quality directly in the IDE with **Snyk Code**\n- How to generate code documentation based on the code directly in the IDE with **Mintlify**\n- The latest and greatest: Examples for coding with **GPT-4**",
        "Date of Evaluation": "2023-07-17",
        "Development Phase": "Code",
        "Adoption Readiness": "Early Adopter",
        "Scopes": "General",
        "Cluster": "Test Automation, Developer Experience, Security, Artificial Intelligence",
        "External Speaker": false
    },
    "ArchitectureEvaluationInAgileContext.md": {
        "Title": "Ecosystem: Architecture evaluations in agile environments",
        "GitHub Path": "https://github.tools.sap/CloudNativeCulture/Ecosystem/blob/main/Sessions/PastSessions/2023/ArchitectureEvaluationInAgileContext.md",
        "Abstract": "",
        "Date of Evaluation": "2023-07-17",
        "Development Phase": "Requirements, Plan",
        "Adoption Readiness": "Ready for Adoption",
        "Scopes": "General",
        "Cluster": "Architecture",
        "External Speaker": true
    },
    "DORA.md": {
        "Title": "Ecosystem: DORA - Why It's Important, And Why It's Challenging",
        "GitHub Path": "https://github.tools.sap/CloudNativeCulture/Ecosystem/blob/main/Sessions/PastSessions/2023/DORA.md",
        "Abstract": "In this talk, DevOps Research and Assessment - DORA - will be introduced. Metrics, such as \"lead time to change\", and more, have been identified in this research as critical for business success. The connection to Cloud Native & DevOps practices & principles will be drawn, and we'll dig a bit into the difficulties, that teams and organizations often face when they try to adopt these. Unsurprisingly, there is also a connection to organization and architecture. Many teams and organizations find it difficult to deliver faster and more frequently and have their service (almost) always available. What environmnent & approach is needed to make it work, and improve on the DORA metrics?",
        "Date of Evaluation": "2023-07",
        "Development Phase": "Cross",
        "Adoption Readiness": "Ready for Adoption",
        "Scopes": "General",
        "Cluster": "DevOps, Developer Experience, Infrastructure, Culture",
        "External Speaker": false
    },
    "GPTbasedQuestionAnswering.md": {
        "Title": "Ecosystem: GPT-based question answering for proprietary or confidential knowledge databases",
        "GitHub Path": "https://github.tools.sap/CloudNativeCulture/Ecosystem/blob/main/Sessions/PastSessions/2023/GPTbasedQuestionAnswering.md",
        "Abstract": "This session bases on the experience collected from building HOUDINIE, a prototype of a secure GPT-based chat interface which answers with up-to-date knowledge from a private text embeddings database.\n\nDuring this session we will show you:\n\n*\tHow to set up the infrastructure for calling the GPT APIs as well as provisioning a vector database for storing fact knowledge\n*\tWhat text embeddings are and how to use them to organize and query a fact database\n*\tHow to create a CAP-based API service to build a question answering application",
        "Date of Evaluation": "2023-04-28",
        "Development Phase": "Code",
        "Adoption Readiness": "Early Adopter",
        "Scopes": "General",
        "Cluster": "Artificial Intelligence",
        "External Speaker": false
    }
}
